Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_dfsdm.h
// CH4CFGR2 Configuration

#define DFSDM_CH4CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH4CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH4CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH4CFGR2_OFFSET_0     (0x1U<<8U)

// CH4AWSCDR Configuration

#define DFSDM_CH4AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH4AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH4AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH4AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH4AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH4AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH4AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH4AWSCDR_AWFORD_0    (0x1U<<22U)

// CH4WDATR Configuration

#define DFSDM_CH4WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH4WDATR_WDATA_0      (0x1U<<0U)

// CH4DATINR Configuration

#define DFSDM_CH4DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH4DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH4DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH4DATINR_INDAT1_0    (0x1U<<16U)

// CH4DLYR Configuration

#define DFSDM_CH4DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH4DLYR_PLSSKP_0      (0x1U<<0U)

// CH5CFGR1 Configuration

#define DFSDM_CH5CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH5CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH5CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH5CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH5CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH5CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH5CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH5CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH5CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH5CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH5CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH5CFGR1_DATPACK_0    (0x1U<<14U)

// CH5CFGR2 Configuration

#define DFSDM_CH5CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH5CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH5CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH5CFGR2_OFFSET_0     (0x1U<<8U)

// CH5AWSCDR Configuration

#define DFSDM_CH5AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH5AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH5AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH5AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH5AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH5AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH5AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH5AWSCDR_AWFORD_0    (0x1U<<22U)

// CH5WDATR Configuration

#define DFSDM_CH5WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH5WDATR_WDATA_0      (0x1U<<0U)

// CH5DATINR Configuration

#define DFSDM_CH5DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH5DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH5DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH5DATINR_INDAT1_0    (0x1U<<16U)

// CH5DLYR Configuration

#define DFSDM_CH5DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH5DLYR_PLSSKP_0      (0x1U<<0U)

// CH6CFGR1 Configuration

#define DFSDM_CH6CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH6CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH6CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH6CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH6CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH6CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH6CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH6CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH6CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH6CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH6CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH6CFGR1_DATPACK_0    (0x1U<<14U)

// CH6CFGR2 Configuration

#define DFSDM_CH6CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH6CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH6CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH6CFGR2_OFFSET_0     (0x1U<<8U)

// CH6AWSCDR Configuration

#define DFSDM_CH6AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH6AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH6AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH6AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH6AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH6AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH6AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH6AWSCDR_AWFORD_0    (0x1U<<22U)

// CH6WDATR Configuration

#define DFSDM_CH6WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH6WDATR_WDATA_0      (0x1U<<0U)

// CH6DATINR Configuration

#define DFSDM_CH6DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH6DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH6DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH6DATINR_INDAT1_0    (0x1U<<16U)

// CH6DLYR Configuration

#define DFSDM_CH6DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH6DLYR_PLSSKP_0      (0x1U<<0U)

// CH7CFGR1 Configuration

#define DFSDM_CH7CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH7CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH7CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH7CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH7CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH7CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH7CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH7CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH7CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH7CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH7CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH7CFGR1_DATPACK_0    (0x1U<<14U)

// CH7CFGR2 Configuration

#define DFSDM_CH7CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH7CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH7CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH7CFGR2_OFFSET_0     (0x1U<<8U)

// CH7AWSCDR Configuration

#define DFSDM_CH7AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH7AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH7AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH7AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH7AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH7AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH7AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH7AWSCDR_AWFORD_0    (0x1U<<22U)

// CH7WDATR Configuration

#define DFSDM_CH7WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH7WDATR_WDATA_0      (0x1U<<0U)

// CH7DATINR Configuration

#define DFSDM_CH7DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH7DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH7DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH7DATINR_INDAT1_0    (0x1U<<16U)

// CH7DLYR Configuration

#define DFSDM_CH7DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH7DLYR_PLSSKP_0      (0x1U<<0U)

