Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_dfsdm.h
#define DFSDM_FLT2AWSR_AWLTF        (0xFFU<<0U)
#define DFSDM_FLT2AWSR_AWLTF_0      (0x1U<<0U)
#define DFSDM_FLT2AWSR_AWHTF        (0xFFU<<8U)
#define DFSDM_FLT2AWSR_AWHTF_0      (0x1U<<8U)

// FLT2AWCFR Configuration

#define DFSDM_FLT2AWCFR_CLRAWLTF    (0xFFU<<0U)
#define DFSDM_FLT2AWCFR_CLRAWLTF_0  (0x1U<<0U)
#define DFSDM_FLT2AWCFR_CLRAWHTF    (0xFFU<<8U)
#define DFSDM_FLT2AWCFR_CLRAWHTF_0  (0x1U<<8U)

// FLT2EXMAX Configuration

#define DFSDM_FLT2EXMAX_EXMAXCH     (0x7U<<0U)
#define DFSDM_FLT2EXMAX_EXMAXCH_0   (0x1U<<0U)
#define DFSDM_FLT2EXMAX_EXMAX       (0xFFFFFFU<<8U)
#define DFSDM_FLT2EXMAX_EXMAX_0     (0x1U<<8U)

// FLT2EXMIN Configuration

#define DFSDM_FLT2EXMIN_EXMINCH     (0x7U<<0U)
#define DFSDM_FLT2EXMIN_EXMINCH_0   (0x1U<<0U)
#define DFSDM_FLT2EXMIN_EXMIN       (0xFFFFFFU<<8U)
#define DFSDM_FLT2EXMIN_EXMIN_0     (0x1U<<8U)

// FLT2CNVTIMR Configuration

#define DFSDM_FLT2CNVTIMR_CNVCNT    (0xFFFFFFFU<<4U)
#define DFSDM_FLT2CNVTIMR_CNVCNT_0  (0x1U<<4U)

// FLT3CR1 Configuration

#define DFSDM_FLT3CR1_DFEN          (0x1U<<0U)
#define DFSDM_FLT3CR1_JSWSTART      (0x1U<<1U)
#define DFSDM_FLT3CR1_JSYNC         (0x1U<<3U)
#define DFSDM_FLT3CR1_JSCAN         (0x1U<<4U)
#define DFSDM_FLT3CR1_JDMAEN        (0x1U<<5U)
#define DFSDM_FLT3CR1_JEXTSEL       (0x7U<<8U)
#define DFSDM_FLT3CR1_JEXTSEL_0     (0x1U<<8U)
#define DFSDM_FLT3CR1_JEXTEN        (0x3U<<13U)
#define DFSDM_FLT3CR1_JEXTEN_0      (0x1U<<13U)
#define DFSDM_FLT3CR1_RSWSTART      (0x1U<<17U)
#define DFSDM_FLT3CR1_RCONT         (0x1U<<18U)
#define DFSDM_FLT3CR1_RSYNC         (0x1U<<19U)
#define DFSDM_FLT3CR1_RDMAEN        (0x1U<<21U)
#define DFSDM_FLT3CR1_RCH           (0x7U<<24U)
#define DFSDM_FLT3CR1_RCH_0         (0x1U<<24U)
#define DFSDM_FLT3CR1_FAST          (0x1U<<29U)
#define DFSDM_FLT3CR1_AWFSEL        (0x1U<<30U)

// FLT3CR2 Configuration

#define DFSDM_FLT3CR2_JEOCIE        (0x1U<<0U)
#define DFSDM_FLT3CR2_REOCIE        (0x1U<<1U)
#define DFSDM_FLT3CR2_JOVRIE        (0x1U<<2U)
#define DFSDM_FLT3CR2_ROVRIE        (0x1U<<3U)
#define DFSDM_FLT3CR2_AWDIE         (0x1U<<4U)
#define DFSDM_FLT3CR2_SCDIE         (0x1U<<5U)
#define DFSDM_FLT3CR2_CKABIE        (0x1U<<6U)
#define DFSDM_FLT3CR2_EXCH          (0xFFU<<8U)
#define DFSDM_FLT3CR2_EXCH_0        (0x1U<<8U)
#define DFSDM_FLT3CR2_AWDCH         (0xFFU<<16U)
#define DFSDM_FLT3CR2_AWDCH_0       (0x1U<<16U)

// FLT3ISR Configuration

#define DFSDM_FLT3ISR_JEOCF         (0x1U<<0U)
#define DFSDM_FLT3ISR_REOCF         (0x1U<<1U)
#define DFSDM_FLT3ISR_JOVRF         (0x1U<<2U)
#define DFSDM_FLT3ISR_ROVRF         (0x1U<<3U)
#define DFSDM_FLT3ISR_AWDF          (0x1U<<4U)
#define DFSDM_FLT3ISR_JCIP          (0x1U<<13U)
#define DFSDM_FLT3ISR_RCIP          (0x1U<<14U)
#define DFSDM_FLT3ISR_CKABF         (0xFFU<<16U)
#define DFSDM_FLT3ISR_CKABF_0       (0x1U<<16U)
#define DFSDM_FLT3ISR_SCDF          (0xFFU<<24U)
#define DFSDM_FLT3ISR_SCDF_0        (0x1U<<24U)

// FLT3ICR Configuration

#define DFSDM_FLT3ICR_CLRJOVRF      (0x1U<<2U)
#define DFSDM_FLT3ICR_CLRROVRF      (0x1U<<3U)
#define DFSDM_FLT3ICR_CLRCKABF      (0xFFU<<16U)
#define DFSDM_FLT3ICR_CLRCKABF_0    (0x1U<<16U)
#define DFSDM_FLT3ICR_CLRSCDF       (0xFFU<<24U)
#define DFSDM_FLT3ICR_CLRSCDF_0     (0x1U<<24U)

// FLT3JCHGR Configuration

#define DFSDM_FLT3JCHGR_JCHG        (0xFFU<<0U)
#define DFSDM_FLT3JCHGR_JCHG_0      (0x1U<<0U)

// FLT3FCR Configuration

#define DFSDM_FLT3FCR_IOSR          (0xFFU<<0U)
#define DFSDM_FLT3FCR_IOSR_0        (0x1U<<0U)
#define DFSDM_FLT3FCR_FOSR          (0x3FFU<<16U)
#define DFSDM_FLT3FCR_FOSR_0        (0x1U<<16U)
#define DFSDM_FLT3FCR_FORD          (0x7U<<29U)
#define DFSDM_FLT3FCR_FORD_0        (0x1U<<29U)

// FLT3JDATAR Configuration

#define DFSDM_FLT3JDATAR_JDATACH    (0x7U<<0U)
#define DFSDM_FLT3JDATAR_JDATACH_0  (0x1U<<0U)
#define DFSDM_FLT3JDATAR_JDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT3JDATAR_JDATA_0    (0x1U<<8U)

// FLT3RDATAR Configuration

#define DFSDM_FLT3RDATAR_RDATACH    (0x7U<<0U)
#define DFSDM_FLT3RDATAR_RDATACH_0  (0x1U<<0U)
#define DFSDM_FLT3RDATAR_RPEND      (0x1U<<4U)
#define DFSDM_FLT3RDATAR_RDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT3RDATAR_RDATA_0    (0x1U<<8U)

// FLT3AWHTR Configuration

#define DFSDM_FLT3AWHTR_BKAWH       (0xFU<<0U)
#define DFSDM_FLT3AWHTR_BKAWH_0     (0x1U<<0U)
#define DFSDM_FLT3AWHTR_AWHT        (0xFFFFFFU<<8U)
#define DFSDM_FLT3AWHTR_AWHT_0      (0x1U<<8U)

// FLT3AWLTR Configuration

#define DFSDM_FLT3AWLTR_BKAWL       (0xFU<<0U)
#define DFSDM_FLT3AWLTR_BKAWL_0     (0x1U<<0U)
#define DFSDM_FLT3AWLTR_AWLT        (0xFFFFFFU<<8U)
#define DFSDM_FLT3AWLTR_AWLT_0      (0x1U<<8U)

// FLT3AWSR Configuration

#define DFSDM_FLT3AWSR_AWLTF        (0xFFU<<0U)
#define DFSDM_FLT3AWSR_AWLTF_0      (0x1U<<0U)
#define DFSDM_FLT3AWSR_AWHTF        (0xFFU<<8U)
#define DFSDM_FLT3AWSR_AWHTF_0      (0x1U<<8U)

// FLT3AWCFR Configuration

#define DFSDM_FLT3AWCFR_CLRAWLTF    (0xFFU<<0U)
#define DFSDM_FLT3AWCFR_CLRAWLTF_0  (0x1U<<0U)
#define DFSDM_FLT3AWCFR_CLRAWHTF    (0xFFU<<8U)
#define DFSDM_FLT3AWCFR_CLRAWHTF_0  (0x1U<<8U)

// FLT3EXMAX Configuration

#define DFSDM_FLT3EXMAX_EXMAXCH     (0x7U<<0U)
#define DFSDM_FLT3EXMAX_EXMAXCH_0   (0x1U<<0U)
#define DFSDM_FLT3EXMAX_EXMAX       (0xFFFFFFU<<8U)
#define DFSDM_FLT3EXMAX_EXMAX_0     (0x1U<<8U)

// FLT3EXMIN Configuration

#define DFSDM_FLT3EXMIN_EXMINCH     (0x7U<<0U)
#define DFSDM_FLT3EXMIN_EXMINCH_0   (0x1U<<0U)
#define DFSDM_FLT3EXMIN_EXMIN       (0xFFFFFFU<<8U)
#define DFSDM_FLT3EXMIN_EXMIN_0     (0x1U<<8U)

// FLT3CNVTIMR Configuration

#define DFSDM_FLT3CNVTIMR_CNVCNT    (0xFFFFFFFU<<4U)
#define DFSDM_FLT3CNVTIMR_CNVCNT_0  (0x1U<<4U)
